src/cf/src/InformationRegisters/ДополнительныеСведенияНоменклатуры/ДополнительныеСведенияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеСведенияНоменклатуры</name>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ДополнительныеСведенияНоменклатуры/ManagerModule.bsl
Функция ПолучитьПоКонтрагенту(Контрагент) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Контрагент КАК Контрагент,
	                      |	ВЗ.Порядок КАК Порядок,
	                      |	ДополнительныеСведенияНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	ДополнительныеСведенияНоменклатуры.Характеристика КАК Характеристика,
	                      |	ДополнительныеСведенияНоменклатуры.Описание КАК Описание
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Контрагенты.Ссылка КАК Контрагент,
	                      |		1 КАК Порядок
	                      |	ИЗ
	                      |		Справочник.Контрагенты КАК Контрагенты
	                      |	ГДЕ
	                      |		Контрагенты.Ссылка = &Контрагент
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Контрагенты.Родитель,
	                      |		2
	                      |	ИЗ
	                      |		Справочник.Контрагенты КАК Контрагенты
	                      |	ГДЕ
	                      |		Контрагенты.Ссылка = &Контрагент
	                      |		И Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ОбособленноеПодразделение)
	                      |		И Контрагенты.Родитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ВЗ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведенияНоменклатуры КАК ДополнительныеСведенияНоменклатуры
	                      |		ПО ВЗ.Контрагент = ДополнительныеСведенияНоменклатуры.Контрагент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВТ.Описание КАК Описание
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТ.Номенклатура КАК Номенклатура,
	                      |		ВТ.Характеристика КАК Характеристика,
	                      |		МИНИМУМ(ВТ.Порядок) КАК Порядок
	                      |	ИЗ
	                      |		ВТ КАК ВТ
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВТ.Номенклатура,
	                      |		ВТ.Характеристика) КАК ВЗ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	                      |		ПО ВЗ.Номенклатура = ВТ.Номенклатура
	                      |			И ВЗ.Характеристика = ВТ.Характеристика
	                      |			И ВЗ.Порядок = ВТ.Порядок");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
